<a href="https://colab.research.google.com/github/gkadusumilli/Machinelearning/blob/master/Pandas_advanced.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [48]:
%load_ext watermark

%watermark -a 'Gopalakrishna' -v -d -p pandas

The watermark extension is already loaded. To reload it, use:
  %reload_ext watermark
Gopalakrishna 2019-12-04

CPython 3.6.8
IPython 5.5.0

pandas 0.25.3

#loding Some Example Data

In [49]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/rasbt/python_reference/master/Data/some_soccer_data.csv')
df

                                          PLAYER  SALARY  ...    PPG       P
0      Sergio Agüero\n Forward — Manchester City  $19.2m  ...  13.12  209.98
1               Eden Hazard\n Midfield — Chelsea  $18.9m  ...  13.05  274.04
2             Alexis Sánchez\n Forward — Arsenal  $17.6m  ...  11.19  223.86
3        Yaya Touré\n Midfield — Manchester City  $16.6m  ...  10.99  197.91
4  Ángel Di María\n Midfield — Manchester United  $15.0m  ...  10.17  132.23
5          Santiago Cazorla\n Midfield — Arsenal  $14.8m  ...   9.97     NaN
6       David Silva\n Midfield — Manchester City  $14.3m  ...  10.35  155.26
7             Cesc Fàbregas\n Midfield — Chelsea  $14.0m  ...  10.47  209.49
8           Saido Berahino\n Forward — West Brom  $13.8m  ...   7.02  147.43
9          Steven Gerrard\n Midfield — Liverpool  $13.8m  ...   7.50  150.01

[10 rows x 8 columns]

#Renaming Column names to lowercase

In [50]:
df.columns=[c.lower() for c in df.columns]

df.tail(3)

                                  player  salary    gp  ...  sot    ppg       p
7     Cesc Fàbregas\n Midfield — Chelsea  $14.0m  20.0  ...   10  10.47  209.49
8   Saido Berahino\n Forward — West Brom  $13.8m  21.0  ...   20   7.02  147.43
9  Steven Gerrard\n Midfield — Liverpool  $13.8m  20.0  ...   11   7.50  150.01

[3 rows x 8 columns]

#Renaming Particular Columns

In [51]:
df=df.rename(columns={'p':'points','gp':'games','sot':'shots on target','g':'goals','ppg':'points_per_game','a':'assists'})

df.tail(3)

                                  player  salary  ...  points_per_game  points
7     Cesc Fàbregas\n Midfield — Chelsea  $14.0m  ...            10.47  209.49
8   Saido Berahino\n Forward — West Brom  $13.8m  ...             7.02  147.43
9  Steven Gerrard\n Midfield — Liverpool  $13.8m  ...             7.50  150.01

[3 rows x 8 columns]

#Changing Values in colums

In [52]:
#processing 'salary' column

df['salary']=df['salary'].apply(lambda x:x.strip('$m'))

df.tail()

                                     player salary  ...  points_per_game  points
5     Santiago Cazorla\n Midfield — Arsenal   14.8  ...             9.97     NaN
6  David Silva\n Midfield — Manchester City   14.3  ...            10.35  155.26
7        Cesc Fàbregas\n Midfield — Chelsea   14.0  ...            10.47  209.49
8      Saido Berahino\n Forward — West Brom   13.8  ...             7.02  147.43
9     Steven Gerrard\n Midfield — Liverpool   13.8  ...             7.50  150.01

[5 rows x 8 columns]

#Adding a new Column

In [53]:
df['team']=pd.Series('',index=df.index)

#or

df.insert(loc=8,column='position',value='')
df.tail(3)

                                  player salary  games  ...  points  position  team
7     Cesc Fàbregas\n Midfield — Chelsea   14.0   20.0  ...  209.49
8   Saido Berahino\n Forward — West Brom   13.8   21.0  ...  147.43
9  Steven Gerrard\n Midfield — Liverpool   13.8   20.0  ...  150.01

[3 rows x 10 columns]

In [54]:
#processing 'player' name

def process_player_col(text):
    name, rest = text.split('\n')
    position, team = [x.strip() for x in rest.split(' — ')]
    return pd.Series([name, team, position])

df[['player', 'team', 'position']] = df.player.apply(process_player_col)


df.tail(3)

           player salary  games  ...  points  position       team
7   Cesc Fàbregas   14.0   20.0  ...  209.49  Midfield    Chelsea
8  Saido Berahino   13.8   21.0  ...  147.43   Forward  West Brom
9  Steven Gerrard   13.8   20.0  ...  150.01  Midfield  Liverpool

[3 rows x 10 columns]

#Applying Functions to multiple columns

In [55]:
cols=['player', 'position', 'team']
df[cols]=df[cols].applymap(lambda x:x.lower())
df.head()

           player salary  games  ...  points  position               team
0   sergio agüero   19.2   16.0  ...  209.98   forward    manchester city
1     eden hazard   18.9   21.0  ...  274.04  midfield            chelsea
2  alexis sánchez   17.6    NaN  ...  223.86   forward            arsenal
3      yaya touré   16.6   18.0  ...  197.91  midfield    manchester city
4  ángel di maría   15.0   13.0  ...  132.23  midfield  manchester united

[5 rows x 10 columns]

#Missing values aka NaNs

##Counting Rows with NaNs

In [56]:
nans=df.shape[0]-df.dropna().shape[0]

print('%d rows have missing values' % nans)

3 rows have missing values

##Selecting NaN Rows

In [57]:
#selecting all rows that have NaNs in the 'assists' column
df[df['assists'].isnull()]

             player salary  games  ...  points  position               team
4    ángel di maría   15.0   13.0  ...  132.23  midfield  manchester united
5  santiago cazorla   14.8   20.0  ...     NaN  midfield            arsenal

[2 rows x 10 columns]

##Selecting non-NaN Rows

In [58]:
df[df['assists'].notnull()]

           player salary  games  ...  points  position             team
0   sergio agüero   19.2   16.0  ...  209.98   forward  manchester city
1     eden hazard   18.9   21.0  ...  274.04  midfield          chelsea
2  alexis sánchez   17.6    NaN  ...  223.86   forward          arsenal
3      yaya touré   16.6   18.0  ...  197.91  midfield  manchester city
6     david silva   14.3   15.0  ...  155.26  midfield  manchester city
7   cesc fàbregas   14.0   20.0  ...  209.49  midfield          chelsea
8  saido berahino   13.8   21.0  ...  147.43   forward        west brom
9  steven gerrard   13.8   20.0  ...  150.01  midfield        liverpool

[8 rows x 10 columns]

##Filling NaN Rows

In [59]:
#filling NaN cells with default value 0

df.fillna(value=0,inplace=True)
df

             player salary  games  ...  points  position               team
0     sergio agüero   19.2   16.0  ...  209.98   forward    manchester city
1       eden hazard   18.9   21.0  ...  274.04  midfield            chelsea
2    alexis sánchez   17.6    0.0  ...  223.86   forward            arsenal
3        yaya touré   16.6   18.0  ...  197.91  midfield    manchester city
4    ángel di maría   15.0   13.0  ...  132.23  midfield  manchester united
5  santiago cazorla   14.8   20.0  ...    0.00  midfield            arsenal
6       david silva   14.3   15.0  ...  155.26  midfield    manchester city
7     cesc fàbregas   14.0   20.0  ...  209.49  midfield            chelsea
8    saido berahino   13.8   21.0  ...  147.43   forward          west brom
9    steven gerrard   13.8   20.0  ...  150.01  midfield          liverpool

[10 rows x 10 columns]

#Appending Rows to a Dataframe

In [60]:
import numpy as np
df=df.append(pd.Series([np.nan]*len(df.columns), index=df.columns),ignore_index=True)

df.tail(3)

            player salary  games  ...  points  position       team
8   saido berahino   13.8   21.0  ...  147.43   forward  west brom
9   steven gerrard   13.8   20.0  ...  150.01  midfield  liverpool
10             NaN    NaN    NaN  ...     NaN       NaN        NaN

[3 rows x 10 columns]

In [61]:
#filling cells with the data

df.loc[df.index[-1],'player']='new player'
df.loc[df.index[-1],'salary']=12.3
df.tail(3)

            player salary  games  ...  points  position       team
8   saido berahino   13.8   21.0  ...  147.43   forward  west brom
9   steven gerrard   13.8   20.0  ...  150.01  midfield  liverpool
10      new player   12.3    NaN  ...     NaN       NaN        NaN

[3 rows x 10 columns]

#Sorting and Reindexing Data Frames

In [62]:
#sorting the Dataframe by a certain column (from highest to lowest)
df.sort_values('goals', ascending=False, inplace=True)
df.head()

           player salary  games  ...  points  position             team
0   sergio agüero   19.2   16.0  ...  209.98   forward  manchester city
2  alexis sánchez   17.6    0.0  ...  223.86   forward          arsenal
8  saido berahino   13.8   21.0  ...  147.43   forward        west brom
1     eden hazard   18.9   21.0  ...  274.04  midfield          chelsea
3      yaya touré   16.6   18.0  ...  197.91  midfield  manchester city

[5 rows x 10 columns]

In [63]:
#optional reindexing of the Dataframe after sorting

df.index=range(1,len(df.index)+1)
df.head()

           player salary  games  ...  points  position             team
1   sergio agüero   19.2   16.0  ...  209.98   forward  manchester city
2  alexis sánchez   17.6    0.0  ...  223.86   forward          arsenal
3  saido berahino   13.8   21.0  ...  147.43   forward        west brom
4     eden hazard   18.9   21.0  ...  274.04  midfield          chelsea
5      yaya touré   16.6   18.0  ...  197.91  midfield  manchester city

[5 rows x 10 columns]

#Updating Columns

In [64]:
#creating a dummy Dataframe with changes in the 'salary' column

df_2=df.copy()
df_2.loc[0:2,'salary']=[20.0,15.0]
df_2.head(3)

           player salary  games  ...  points  position             team
1   sergio agüero     20   16.0  ...  209.98   forward  manchester city
2  alexis sánchez     15    0.0  ...  223.86   forward          arsenal
3  saido berahino   13.8   21.0  ...  147.43   forward        west brom

[3 rows x 10 columns]

In [65]:
#temporarily use the 'player' columns as indices to apply the update functions

df.set_index('player',inplace=True)
df_2.set_index('player',inplace=True)
df.head(3)

               salary  games  goals  ...  points  position             team
player                               ...
sergio agüero    19.2   16.0   14.0  ...  209.98   forward  manchester city
alexis sánchez   17.6    0.0   12.0  ...  223.86   forward          arsenal
saido berahino   13.8   21.0    9.0  ...  147.43   forward        west brom

[3 rows x 9 columns]

In [66]:
#update the 'salary' column
df.update(other=df_2['salary'],overwrite=True)
df.head(3)

               salary  games  goals  ...  points  position             team
player                               ...
sergio agüero      20   16.0   14.0  ...  209.98   forward  manchester city
alexis sánchez     15    0.0   12.0  ...  223.86   forward          arsenal
saido berahino   13.8   21.0    9.0  ...  147.43   forward        west brom

[3 rows x 9 columns]

In [67]:
#reset the indices

df.reset_index(inplace=True)
df.head(3)

           player salary  games  ...  points  position             team
0   sergio agüero     20   16.0  ...  209.98   forward  manchester city
1  alexis sánchez     15    0.0  ...  223.86   forward          arsenal
2  saido berahino   13.8   21.0  ...  147.43   forward        west brom

[3 rows x 10 columns]

#Chaining Conditions-Using Bitwise Operators

In [68]:
df[(df['team']=='arsenal')|(df['team']=='chelsea')]

             player salary  games  ...  points  position     team
1    alexis sánchez     15    0.0  ...  223.86   forward  arsenal
3       eden hazard   18.9   21.0  ...  274.04  midfield  chelsea
7  santiago cazorla   14.8   20.0  ...    0.00  midfield  arsenal
9     cesc fàbregas   14.0   20.0  ...  209.49  midfield  chelsea

[4 rows x 10 columns]

In [69]:
#selecting forwards from arsenal only

df[(df['team']=='arsenal')&(df['position']=='forward')]

           player salary  games  ...  points  position     team
1  alexis sánchez     15    0.0  ...  223.86   forward  arsenal

[1 rows x 10 columns]

#Column Types

##printing column types

In [70]:
types=df.columns.to_series().groupby(df.dtypes).groups
types

{dtype('float64'): Index(['games', 'goals', 'assists', 'shots on target', 'points_per_game',
        'points'],
       dtype='object'),
 dtype('O'): Index(['player', 'salary', 'position', 'team'], dtype='object')}

##Selecting Column Type

In [71]:
#select string columns
df.loc[:, (df.dtypes == np.dtype('O')).values].head()

           player salary  position             team
0   sergio agüero     20   forward  manchester city
1  alexis sánchez     15   forward          arsenal
2  saido berahino   13.8   forward        west brom
3     eden hazard   18.9  midfield          chelsea
4      yaya touré   16.6  midfield  manchester city

##Converting Column Type

In [0]:
df['salary']=df['salary'].astype(float)

In [73]:
types = df.columns.to_series().groupby(df.dtypes).groups
types

{dtype('float64'): Index(['salary', 'games', 'goals', 'assists', 'shots on target',
        'points_per_game', 'points'],
       dtype='object'),
 dtype('O'): Index(['player', 'position', 'team'], dtype='object')}

#if-tests

iif-test i pandas, create an array of 1's and 0's depending on condition.
e.g, if **val** less than 0.5->0, else ->1. usig the boolean mask. since  **True** and **false** are integers after all

In [74]:
int(True)

1

In [75]:
import pandas as pd

a=[[2.,.3,4.,5.],[.8,.03,0.02,5.]]
df=pd.DataFrame(a)
df

     0     1     2    3
0  2.0  0.30  4.00  5.0
1  0.8  0.03  0.02  5.0

In [76]:
df=df<=0.05
df

       0      1      2      3
0  False  False  False  False
1  False   True   True  False

In [77]:
df.astype(int)

   0  1  2  3
0  0  0  0  0
1  0  1  1  0